src/DataProcessors/ПодборНоменклатурыГосЗакупок/ПодборНоменклатурыГосЗакупок.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>ПодборНоменклатурыГосЗакупок</name>
  <tabularSections>
    <name>ПодобраннаяНоменклатура</name>
    <attributes>
      <name>НоменклатураГосЗакупок</name>
      <type>
        <types>CatalogRef.НоменклатураГосЗакупок</types>
      </type>
    </attributes>
    <attributes>
      <name>ЕдиницаИзмеренияГосЗакупок</name>
      <type>
        <types>CatalogRef.КлассификаторЕдиницИзмерения</types>
      </type>
    </attributes>
    <attributes>
      <name>КоэффициентГосЗакупок</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>5</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоГосЗакупок</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЦенаГосЗакупок</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>ЕдиницаИзмерения</name>
      <type>
        <types>CatalogRef.КлассификаторЕдиницИзмерения</types>
      </type>
    </attributes>
    <attributes>
      <name>СтавкаНДС</name>
      <type>
        <types>EnumRef.СтавкиНДС</types>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>НоменклатураГосЗакупок</name>
    <attributes>
      <name>НоменклатураГосЗакупок</name>
      <type>
        <types>CatalogRef.НоменклатураГосЗакупок</types>
      </type>
    </attributes>
    <attributes>
      <name>Наименование</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЕдиницаИзмеренияГосЗакупок</name>
      <type>
        <types>CatalogRef.КлассификаторЕдиницИзмерения</types>
      </type>
    </attributes>
    <attributes>
      <name>Коэффициент</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>5</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Валюта</name>
      <type>
        <types>CatalogRef.Валюты</types>
      </type>
    </attributes>
    <attributes>
      <name>ЦенаГосЗакупок</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоОстаток</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:DataProcessor>

src/Catalogs/Номенклатура/Номенклатура.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension">
  <name>Номенклатура</name>
  <objectBelonging>Adopted</objectBelonging>
  <extension>
    <hierarchical>Checked</hierarchical>
    <hierarchyType>Checked</hierarchyType>
  </extension>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>СтранаПроисхождения</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ПериодичностьУслуги</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Артикул</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>25</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>ПродукцияМаркируемаяДляГИСМ</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ВидНоменклатуры</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>НомерГТД</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>КодТНВЭД</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>НоменклатурнаяГруппа</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ВидСтавкиНДС</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>КодРаздел7ДекларацииНДС</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ПодконтрольнаяПродукцияВЕТИС</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ЕдиницаИзмерения</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ТабачнаяПродукция</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>СтатьяЗатрат</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Производитель</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>КодОКП</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Импортер</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Услуга</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>КодОКВЭД</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>КодОКВЭД2</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>КодОКПД2</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ВесЕдиницы</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НаименованиеПолное</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>1000</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>НоменклатурнаяГруппаГруппы</name>
    <type>
      <types>CatalogRef.НоменклатурныеГруппы</types>
    </type>
  </attributes>
  <tabularSections>
    <name>МногооборотнаяТара</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоВМесте</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

src/DataProcessors/ПодборНоменклатурыГосЗакупок/Forms/ФормаВводаНоменклатураЦенаКоличество/Module.bsl
&НаКлиенте
Перем НоменклатураВыбрана;

////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ФОРМЫ

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	СписокСвойств = "ДатаРасчетов, НоменклатураГосЗакупок, ЕдиницаИзмеренияГосЗакупок,
	                |КоличествоГосЗакупок, ЦенаГосЗакупок, Валюта, Организация, Склад";
	
	ЗаполнитьЗначенияСвойств(ЭтотОбъект, Параметры, СписокСвойств);
	
	Если НЕ ЗначениеЗаполнено(НоменклатураГосЗакупок) тогда
		Отказ = Истина;
		Возврат;
	КонецЕсли;
	
	Если Параметры.Свойство("Номенклатура") тогда
		Номенклатура = Параметры.Номенклатура;
	КонецЕсли;
	
	Если Параметры.Свойство("ЕдиницаИзмерения") тогда
		ЕдиницаИзмерения = Параметры.ЕдиницаИзмерения;
	Иначе
		СвойстваНоменклатуры = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(НоменклатураГосЗакупок, "ЕдиницаИзмеренияГосЗакупок");
		
		Заголовок = СвойстваНоменклатуры.Наименование;
		Если НЕ ЗначениеЗаполнено(ЕдиницаИзмерения) Тогда
			ЕдиницаИзмерения = СвойстваНоменклатуры.ЕдиницаИзмерения;
		КонецЕсли;
	КонецЕсли;
	
	Если КоличествоГосЗакупок = 1 тогда
		КоличествоГосЗакупок = 0;
	КонецЕсли;
	
	Сумма = ЦенаГосЗакупок * КоличествоГосЗакупок;
	
	ВидСтавкиНДС = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(НоменклатураГосЗакупок, "ВидСтавкиНДС");
	СтавкаНДС = Перечисления.СтавкиНДС.СтавкаНДС(ВидСтавкиНДС, ТекущаяДата());
	
	Если ЗначениеЗаполнено(Номенклатура) тогда
		ТекущийЭлемент = Элементы.ТаблицаНоменклатуры;
	КонецЕсли;
	
	Если ЕдиницаИзмеренияГосЗакупок.Дробная тогда
		Элементы.КоличествоГосЗакупок.ФорматРедактирования = "ЧЦ=15; ЧДЦ=3";
	Иначе
		Элементы.КоличествоГосЗакупок.ФорматРедактирования = "ЧЦ=15; ЧДЦ=0";
	КонецЕсли;
	
	ЗаполнитьТаблицуНоменклатура();
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	НоменклатураВыбрана = Ложь;
	БыстрыйВвод = Истина;
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ЭЛЕМЕНТОВ ШАПКИ ФОРМЫ

&НаКлиенте
Процедура КоличествоПриИзменении(Элемент)
	
	Сумма = ЦенаГосЗакупок * КоличествоГосЗакупок;
	
	Если БыстрыйВвод И ИспользоватьБыстрыйВвод И НоменклатураВыбрана тогда
		ОК(Команды.Найти("ОК"));
	КонецЕсли;
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ КОМАНД ФОРМЫ

&НаСервере
Процедура ЗаполнитьТаблицуНоменклатура()

	ВыбраннаяНоменклатура = Номенклатура;
	Номенклатура = ПредопределенноеЗначение("Справочник.Номенклатура.ПустаяСсылка");
	
	ПараметрыТаблицыНоменклатурыГосЗакупок = Новый Структура;
	ПараметрыТаблицыНоменклатурыГосЗакупок.Вставить("ДатаОстатков", ДатаРасчетов);
	ПараметрыТаблицыНоменклатурыГосЗакупок.Вставить("ПоказатьЦены", Ложь);
	ПараметрыТаблицыНоменклатурыГосЗакупок.Вставить("ПоказатьОстатки", Истина);
	ПараметрыТаблицыНоменклатурыГосЗакупок.Вставить("ОтборПоОстаткам", ПоказыватьТолькоОстатки);
	ПараметрыТаблицыНоменклатурыГосЗакупок.Вставить("НоменклатураГосЗакупок", НоменклатураГосЗакупок);
	ПараметрыТаблицыНоменклатурыГосЗакупок.Вставить("Организация", Организация);
	ПараметрыТаблицыНоменклатурыГосЗакупок.Вставить("Склад", Склад);
	ПараметрыТаблицыНоменклатурыГосЗакупок.Вставить("ТипНоменклатуры", "Номенклатура");
	
	ВремТаблицаНоменклатуры = ГосЗакупкиСервер.ТаблицаНоменклатурыГосЗакупок(ПараметрыТаблицыНоменклатурыГосЗакупок);
	Если ВремТаблицаНоменклатуры = Неопределено тогда
		ТаблицаНоменклатуры.Очистить();
		Возврат;
	КонецЕсли;
	
	ВремТаблицаНоменклатуры.Сортировать("ЕстьОстаток УБЫВ, Наименование, КоличествоОстаток УБЫВ");
	
	ТаблицаНоменклатуры.Загрузить(ВремТаблицаНоменклатуры);
	
	Если ЗначениеЗаполнено(ВыбраннаяНоменклатура) тогда
		Отборы = Новый Структура;
		Отборы.Вставить("Номенклатура", Номенклатура);
		
		НайденыеСтроки = ТаблицаНоменклатуры.НайтиСтроки(Отборы);
		
		Если НайденыеСтроки.Количество() > 0 тогда
			ПерваяНайденаяСтрока = НайденыеСтроки.Получить(0);
			Элементы.ТаблицаНоменклатуры.ТекущаяСтрока = ПерваяНайденаяСтрока.ПолучитьИдентификатор();
			Номенклатура = ПерваяНайденаяСтрока.Номенклатура;
		КонецЕсли;
		
	КонецЕсли;	
КонецПроцедуры

&НаКлиенте
Процедура СброситьБыстрыйВыбор()
	
	БыстрыйВвод = Ложь;
	ЭтаФорма.ПоведениеКлавишиEnter = ТипПоведенияКлавишиEnter.ПереходПоЭлементамФормы;
	
КонецПроцедуры

&НаКлиенте
Процедура ОК(Команда)
	
	Если НЕ ЗначениеЗаполнено(КоличествоГосЗакупок) ИЛИ НЕ ЗначениеЗаполнено(Номенклатура) Тогда
		СброситьБыстрыйВыбор();
		Возврат;
	КонецЕсли;
	
	ПараметрыЗакрытия = Новый Структура("НоменклатураГосЗакупок, ЕдиницаИзмеренияГосЗакупок,
	                                    |Номенклатура, ЕдиницаИзмерения, Склад,
										|КоличествоГосЗакупок, КоэффициентГосЗакупок,
										|ЦенаГосЗакупок, Валюта, СтавкаНДС, ДатаРасчетов");
	
	ЗаполнитьЗначенияСвойств(ПараметрыЗакрытия, ЭтотОбъект);	
	Закрыть(ПараметрыЗакрытия);
	
КонецПроцедуры

&НаКлиенте
Процедура Отмена(Команда)
	
	Закрыть(Неопределено);
	
КонецПроцедуры

&НаКлиенте
Процедура СписокНоменклатурыПриАктивизацииСтроки(Элемент)
	
	Если Элементы.ТаблицаНоменклатуры.ТекущиеДанные = Неопределено тогда
		Возврат
	КонецЕсли;
	
	Элементы.ОК.Доступность = НЕ Элементы.ТаблицаНоменклатуры.ТекущаяСтрока = Неопределено;
	КоэффициентГосЗакупок = Элементы.ТаблицаНоменклатуры.ТекущиеДанные.КоэффициентГосЗакупок;
	Номенклатура = Элементы.ТаблицаНоменклатуры.ТекущиеДанные.Номенклатура;
	
	Если НоменклатураВыбрана тогда
		СброситьБыстрыйВыбор();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура КоличествоРегулирование(Элемент, Направление, СтандартнаяОбработка)
	
	СброситьБыстрыйВыбор();
	
КонецПроцедуры

&НаКлиенте
Процедура КоличествоОчистка(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	КоличествоГосЗакупок = 1;
	СброситьБыстрыйВыбор();
	
КонецПроцедуры

&НаКлиенте
Процедура КоличествоНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СброситьБыстрыйВыбор();
	
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаНоменклатурыПриАктивизацииПоля(Элемент)
	
	Если НоменклатураВыбрана тогда
		СброситьБыстрыйВыбор();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПоказыватьТолькоОстаткиПриИзменении(Элемент)
	
	ЗаполнитьТаблицуНоменклатура();
	
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаНоменклатурыВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ТекущийЭлемент = Элементы.КоличествоГосЗакупок;
	НоменклатураВыбрана = Истина;
	
КонецПроцедуры
